#!/bin/sh

none='\033[0m'      # 重置颜色到默认
red='\033[1;31m'    # 红色
green='\033[1;32m'  # 绿色
yellow='\033[1;33m' # 黄色
blue='\033[1;34m'   # 蓝色
purple='\033[1;35m' # 紫色
cyan='\033[1;36m'   # 青色

_print_color() {
    color=$1
    shift
    echo -e "${color}$*${none}"
}

_red() { _print_color "${red}" "$*"; }
_green() { _print_color "${green}" "$*"; }
_yellow() { _print_color "${yellow}" "$*"; }
_blue() { _print_color "${blue}" "$*"; }
_purple() { _print_color "${purple}" "$*"; }
_cyan() { _print_color "${cyan}" "$*"; }

_blue "======================================================"
_blue "= ███████╗██╗   ██╗███████╗██╗  ██╗███████╗██╗   ██╗ ="
_blue "= ██╔════╝╚██╗ ██╔╝██╔════╝██║ ██╔╝██╔════╝╚██╗ ██╔╝ ="
_blue "= ███████╗ ╚████╔╝ ███████╗█████╔╝ █████╗   ╚████╔╝  ="
_blue "= ╚════██║  ╚██╔╝  ╚════██║██╔═██╗ ██╔══╝    ╚██╔╝   ="
_blue "= ███████║   ██║   ███████║██║  ██╗███████╗   ██║    ="
_blue "= ╚══════╝   ╚═╝   ╚══════╝╚═╝  ╚═╝╚══════╝   ╚═╝    ="
_blue "=                                                    ="
_blue "=                 author: syskey                     ="
_blue "=                                                    ="
_blue "======================================================"
